[
  {
    "title": "The Inception",
    "date": "Long, Long Ago",
    "body": "Nearly 20 years ago, {a magical world} came to be in the mind of Danny Cole. And that world is Creature World.",
    "linkUrl": "//twitter.com/dannycoleee/status/1424465785431465990"
  },
  {
    "title": "The First Journey (the mint)",
    "date": "Saturday August 28th",
    "body": "10,000 magical beings we call Creatures were released into the world. They were borne from the Creature World, a dreamland of Danny Cole's creation. All 10,000 Creatures found their forever home within 13 minutes."
  },
  {
    "title": "The Gifting",
    "date": "Sunday August 29th",
    "body": "300 Creatures that had been reserved mints for the Residents (the community's most active, devoted members) were distributed to them for free. Long live the community. "
  },
  {
    "title": "The Gary",
    "date": "Sunday August 29th",
    "body": "Gary Vee wins the live \"Creature Noise Competition\" and {made a public bet} on the success of Creature World.",
    "linkUrl": "//twitter.com/creatureNFT/status/1432178770920808451?s=20"
  },
  {
    "title": "The Guide",
    "date": "Tuesday August 31st",
    "body": "It was announced that Creature World would not live on any rarity sites. This project ventures into uncharted territory. The current systems are not designed for The Creature World. The Creature guides you on this journey. All will make sense. If you love your Creature, you have the rarest Creature in the universe."
  },
  {
    "title": "VICE",
    "date": "Saturday September 4th",
    "body": "On this day, the {VICE Documentary} featuring Danny Cole was released.",
    "linkUrl": "//twitter.com/creatureNFT/status/1434177203948896260"
  },
  {
    "title": "Nifty Gateway",
    "date": "Wednesday September 8th",
    "body": "The Creatures arrived on {Nifty Gateway} as their first verified collection. The Winklevoss twins joined the journey and changed their profile pictures accordingly.",
    "linkUrl": "//niftygateway.com/profile/creatureworld"
  },
  {
    "title": "The Giving",
    "date": "Saturday September 18th",
    "body": "It was on this day that Creature World officially crossed 5,000 (50%) Unique Holders. To celebrate, 100 holders were rewarded with an original Creature World: The Creatures Are Coming poster from the original launch campaign in NYC."
  },
  {
    "title": "The Playground",
    "date": "Thursday September 23rd",
    "body": "The Playground was the Creature World's first official airdrop to Creature holders. It consisted of 7 Unique 3D Renderings that were randomly (and equally) distributed to all current holders from a snapshot taken the day prior. \n\nWith these 7 pieces, the assignment was to team up with other Creatures in order to collect all 7 unique pieces within one wallet. And for what? That part of the journey hasn't been told yet. \n\nAt this time there have been over 300 unique groups, over 2,100 Creatures, that have formed a trusted pact and built their playground together. "
  },
  {
    "title": "The Shaquening",
    "date": "Monday September 27th",
    "body": "The one and only {Shaquille O'Neal} purchased a raincoat Creature and joined Creature World as his first foray into NFTs.",
    "linkUrl": "//twitter.com/SHAQ"
  }
]
